docs: use mermaid diagrams in PDC design
